ACCEPT nombre
IF nombre = "Juan"
    DISPLAY "Hola Juan"
    DISPLAY "Hola"
    IF nombre = "Francesco"
        DISPLAY nombre
        DISPLAY "this is un if anidado"
    ELSE
        DISPLAY "ZZZ mi estimado"
    END-IF
ELSE
    DISPLAY "JAJA"
END-IF
DISPLAY "Este queda fuera"
DISPLAY "Hola mama"
IF nombre = "Adriano"
    DISPLAY "Hola Adriano"
    DISPLAY "Este es otro bloque"
    DISPLAY "De ifs"
END-IF
DISPLAY "Fin del programa xd"