DISPLAY "Enter your name:"
ACCEPT USERNAME
DISPLAY "Enter your age:"
ACCEPT AGE
DISPLAY "Enter your country:"
ACCEPT COUNTRY
IF AGE = 18
    MOVE "You are a minor." TO MESSAGE
    IF COUNTRY < 14
        DISPLAY "You need parental consent."
    ELSE
        DISPLAY "Consent laws vary by country."
    END-IF
ELSE
    MOVE "You are an adult." TO MESSAGE
END-IF
DISPLAY MESSAGE
ADD 12 TO AGE
ADD COUNTRY TO AGE
SUBTRACT 10 FROM AGE
SUBTRACT USERNAME FROM AGE
DISPLAY AGE
MULTIPLY 12 BY AGE
MULTIPLY COUNTRY BY COUNTRY
DIVIDE 2 INTO AGE
DIVIDE AGE INTO COUNTRY
DIVIDE AGE BY 2
DIVIDE AGE BY COUNTRY
DISPLAY "End of program."